 // Вывести квадрат числа 4, 3, 7
Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine());
int sqrt = number * number;
Console.Write($"Квадрат числа {number} = {sqrt}");